---
kind: type
id: T:Autodesk.Revit.DB.ExportDWGSettings
source: html/a17fc52f-f67a-9763-e52f-29f867106908.htm
---
# Autodesk.Revit.DB.ExportDWGSettings

This element contains DWG/DXF export settings which are saved in a Revit document.

## Syntax (C#)
```csharp
public class ExportDWGSettings : Element
```